###############################################################################
# Created by write_sdc
# Mon Sep 23 22:40:29 2024
###############################################################################
current_design designs_wrapper
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 25.0000 [get_ports {i_clock}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_clock_latency -source -min 4.6500 [get_clocks {clk}]
set_clock_latency -source -max 5.5700 [get_clocks {clk}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.1900 [get_ports {o_ADC_frame}]
set_load -pin_load 0.1900 [get_ports {o_control_signal}]
set_load -pin_load 0.1900 [get_ports {o_phi_l1}]
set_load -pin_load 0.1900 [get_ports {o_phi_l2}]
set_load -pin_load 0.1900 [get_ports {o_phi_p}]
set_load -pin_load 0.1900 [get_ports {o_phi_r}]
set_load -pin_load 0.1900 [get_ports {o_pixel_flag}]
set_load -pin_load 0.1900 [get_ports {o_wb_ack}]
set_load -pin_load 0.1900 [get_ports {io_oeb[19]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[18]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[17]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[16]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[15]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[14]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[13]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[12]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[11]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[10]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[9]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[8]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[7]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[6]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[5]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[4]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[3]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[2]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[1]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[0]}]
set_load -pin_load 0.1900 [get_ports {o_test[4]}]
set_load -pin_load 0.1900 [get_ports {o_test[3]}]
set_load -pin_load 0.1900 [get_ports {o_test[2]}]
set_load -pin_load 0.1900 [get_ports {o_test[1]}]
set_load -pin_load 0.1900 [get_ports {o_test[0]}]
set_load -pin_load 0.1900 [get_ports {o_wb_data[31]}]
set_load -pin_load 0.1900 [get_ports {o_wb_data[30]}]
set_load -pin_load 0.1900 [get_ports {o_wb_data[29]}]
set_load -pin_load 0.1900 [get_ports {o_wb_data[28]}]
set_load -pin_load 0.1900 [get_ports {o_wb_data[27]}]
set_load -pin_load 0.1900 [get_ports {o_wb_data[26]}]
set_load -pin_load 0.1900 [get_ports {o_wb_data[25]}]
set_load -pin_load 0.1900 [get_ports {o_wb_data[24]}]
set_load -pin_load 0.1900 [get_ports {o_wb_data[23]}]
set_load -pin_load 0.1900 [get_ports {o_wb_data[22]}]
set_load -pin_load 0.1900 [get_ports {o_wb_data[21]}]
set_load -pin_load 0.1900 [get_ports {o_wb_data[20]}]
set_load -pin_load 0.1900 [get_ports {o_wb_data[19]}]
set_load -pin_load 0.1900 [get_ports {o_wb_data[18]}]
set_load -pin_load 0.1900 [get_ports {o_wb_data[17]}]
set_load -pin_load 0.1900 [get_ports {o_wb_data[16]}]
set_load -pin_load 0.1900 [get_ports {o_wb_data[15]}]
set_load -pin_load 0.1900 [get_ports {o_wb_data[14]}]
set_load -pin_load 0.1900 [get_ports {o_wb_data[13]}]
set_load -pin_load 0.1900 [get_ports {o_wb_data[12]}]
set_load -pin_load 0.1900 [get_ports {o_wb_data[11]}]
set_load -pin_load 0.1900 [get_ports {o_wb_data[10]}]
set_load -pin_load 0.1900 [get_ports {o_wb_data[9]}]
set_load -pin_load 0.1900 [get_ports {o_wb_data[8]}]
set_load -pin_load 0.1900 [get_ports {o_wb_data[7]}]
set_load -pin_load 0.1900 [get_ports {o_wb_data[6]}]
set_load -pin_load 0.1900 [get_ports {o_wb_data[5]}]
set_load -pin_load 0.1900 [get_ports {o_wb_data[4]}]
set_load -pin_load 0.1900 [get_ports {o_wb_data[3]}]
set_load -pin_load 0.1900 [get_ports {o_wb_data[2]}]
set_load -pin_load 0.1900 [get_ports {o_wb_data[1]}]
set_load -pin_load 0.1900 [get_ports {o_wb_data[0]}]
set_input_transition 0.6100 [get_ports {i_clock}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 1.0000 [current_design]
set_max_fanout 16.0000 [current_design]
